###################################################################

# Created by write_sdc on Sun Jan  3 18:43:13 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[31]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[30]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[29]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[28]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[27]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[26]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[25]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[24]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[23]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[22]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[21]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[20]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[19]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[18]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[17]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[16]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[15]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[14]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[13]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[12]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[11]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[10]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[9]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[8]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[7]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[6]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[5]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[4]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[3]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[2]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[1]}]
set_load -pin_load 3.40189 [get_ports {ADDR_INSTR[0]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[31]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[30]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[29]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[28]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[27]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[26]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[25]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[24]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[23]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[22]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[21]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[20]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[19]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[18]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[17]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[16]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[15]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[14]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[13]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[12]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[11]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[10]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[9]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[8]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[7]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[6]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[5]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[4]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[3]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[2]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[1]}]
set_load -pin_load 3.40189 [get_ports {ADDR_DATA[0]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[31]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[30]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[29]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[28]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[27]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[26]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[25]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[24]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[23]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[22]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[21]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[20]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[19]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[18]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[17]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[16]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[15]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[14]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[13]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[12]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[11]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[10]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[9]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[8]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[7]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[6]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[5]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[4]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[3]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[2]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[1]}]
set_load -pin_load 3.40189 [get_ports {MEM_DATA_OUT[0]}]
set_load -pin_load 3.40189 [get_ports MEM_DATA_WRITE]
set_load -pin_load 3.40189 [get_ports MEM_DATA_READ]
create_clock [get_ports CLK]  -name MY_CLK  -period 20  -waveform {0 10}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RSTn]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ASYNC_RSTn]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports EN]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_INSTR[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_IN[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_INSTR[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ADDR_DATA[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MEM_DATA_OUT[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MEM_DATA_WRITE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MEM_DATA_READ]
