read_verilog -netlist ../netlist/myiir_adv.v
read_saif -input ../saif/myiir_adv_syn.saif -instance tb_iir/UUT -unit ns -scale 1 
create_clock -name MY_CLK CLK
report_power -net -cell -hier > power.txt
